Revit 2027 API
BuiltInFailures.SiteFailures.RegionPhaseMismatch Property
 Subregions must have the same Phase Created parameter and Phase Demolished parameter as the host Toposurface. Subregion phase will be set to match the Toposurface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RegionPhaseMismatch { get; }
Public Shared ReadOnly Property RegionPhaseMismatch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RegionPhaseMismatch {
	FailureDefinitionId^ get ();
}
static member RegionPhaseMismatch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace